IvanovDmitriy09/Eclipse_templates/Gigadevice/GD32H7xx/system/src/cmsis/vectors_gd32h7xx.c
void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel3_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ENET0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ENET0_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel5_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel6_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel7_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART5_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C2_EV_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C2_ER_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS0_EP1_OUT_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS0_EP1_IN_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS0_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DCI_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CAU_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
HAU_TRNG_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
FPU_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
UART6_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
UART7_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI3_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI5_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SAI0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TLI_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TLI_ER_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
IPA_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SAI1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
OSPI0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C3_EV_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C3_ER_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RSPDIF_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMAMUX_OVR_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
HPDF_INT0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
HPDF_INT1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
HPDF_INT2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
HPDF_INT3_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SAI2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER14_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER15_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER16_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
MDIO_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
MDMA_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SDIO1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
HWSEM_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ADC2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CMP0_1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CTC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RAMECCMU_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
OSPI1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RTDEC0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RTDEC1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
FAC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMU_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER22_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER23_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER30_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER31_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER40_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER41_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER42_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER43_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER44_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER50_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER51_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS1_EP1_OUT_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS1_EP1_IN_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS1_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBHS1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ENET1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ENET1_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CAN0_WKUP_IRQHandler(void);

